# Parameter Type Id Assembly Description Property

Source: https://www.revitapidocs.com/2026/7fa27dcb-90dc-4d64-39d4-49f595c0de92.htm

---

| Parameter Type Id Assembly Description Property |
| --- |

"Assembly Description"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId AssemblyDescription { get; }
```

```
Public Shared ReadOnly Property AssemblyDescription As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ AssemblyDescription {
	ForgeTypeId^ get ();
}
```

```
static member AssemblyDescription : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace